// задача 12: да се напише функция с параметър мъасив от числа,
//  която връща локалните максимуми в  масива като tuple (стойност, индекс).
// локален максимум е елемент който е по голям от съседните си елементи
// Пример
// 1, 2, 3, 2, 0, 6, 5 -> (3, 2), (6, 5)

// evgeni.milev  2:23 PM
// малка промяна на условието - само по отношене на на изобразяването
// 2:24
// задача 12: да се напише функция с параметър мъасив от числа,
//  която намира локалните максимуми в  масива и разпечатва масива,
//   като максимумите са заградени в скоби. локален максимум е елемент 
//   който е по голям от съседните си елементи
// Пример
// 1, 2, 3, 2, 0, 6, 5 -> 1 2 [3] 2 0 [6] 5

// Групова задача с Микаела Златанова

func localMaximums (_ arr : [Int] ) -> [String] {
    var res = [String]()
    res.append(String(arr[0]))
    
    for i in 1..<arr.count - 1 {
        if arr[i] > arr[i - 1] && arr[i] > arr[i + 1] {
            res.append("[" + String(arr[i]) + "]")
        }
        else {
            res.append(String(arr[i]))
        }
    }

    res.append(String(arr[arr.count-1]))
    return res
}

var result = localMaximums([1, 2, 3, 2, 0, 5, 6])
print(result)